backend/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "published", "image", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "test"], ["author", "Test"], ["published", 0], ["image", "Test"], ["category_id", 4], ["created_at", "2020-12-01 22:44:01.708406"], ["updated_at", "2020-12-01 22:44:01.708406"]]
---
    def create
        @book = Book.create(book_params)